app/controllers/families_controller.rb

SELECT "families".* FROM "families"
---
  def index
    @families = Family.all

SELECT "families".* FROM "families" WHERE "families"."id" = 980190962 LIMIT 1
---
  def show
    @family = Family.find(params[:id])

SELECT "families".* FROM "families" WHERE "families"."id" = 980190962 LIMIT 1
---
  def edit
    @family = Family.find(params[:id])

INSERT INTO "families" ("energy", "updated_at", "created_at", "name") VALUES (NULL, '2011-05-16 14:19:09.000000', '2011-05-16 14:19:09.000000', NULL)
---
  def create
    @family = Family.new(params[:family])

    respond_to do |format|
      if @family.save

SELECT "families".* FROM "families" WHERE "families"."id" = 980190962 LIMIT 1
---
  def update
    @family = Family.find(params[:id])

SELECT "families".* FROM "families" WHERE "families"."id" = 980190962 LIMIT 1
DELETE FROM "families" WHERE "families"."id" = 980190962
---
  def destroy
    @family = Family.find(params[:id])
    @family.destroy