app/controllers/plants_controller.rb

  def show
    @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = 980190962 LIMIT 1

  def edit
    @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = 980190962 LIMIT 1

  def create
    @plant = Plant.new(params[:plant])
    respond_to do |format|
      if @plant.save
---
INSERT INTO "plants" ("name", "updated_at", "family_id", "created_at") VALUES ('Zwiebel', '2011-05-16 14:19:09.000000', NULL, '2011-05-16 14:19:09.000000')

  def update
    @plant = Plant.find(params[:id])
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = 980190962 LIMIT 1

  def destroy
    @plant = Plant.find(params[:id])
    @plant.destroy
---
SELECT "plants".* FROM "plants" WHERE "plants"."id" = 980190962 LIMIT 1
DELETE FROM "plants" WHERE "plants"."id" = 980190962